Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: དགོན་པ་དང་རབ་ཏུ་དགོན་པ་འདི་དག་ནི་སངས་རྒྱས་ཀྱིས་བསྔགས་པ་ཡིན་ཏེ། དགོན་པ་ནི་གནས་ན་སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བ་ལ་དམིགས་པ་ནི་བདག་གིས་བྲེ་མོ་གཏམ་ཟེར་བ་ཡིན་གྱི།
en: The first is the thought, ‘The forest and jungle are praised by the buddhas and, if one lives in the forest, one can focus with great compassion on freeing all beings.

source: ཕྱོགས་གཅིག་ཏུ་གྱུར་པ་ནི་མ་ཡིན་ནོ་སྙམ་པ་དང་། བདག་གིས་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་བསགས་ཀྱི་ཉོན་མོངས་པ་རྣམས་ནི་མ་ཡིན་ནོ་སྙམ་པ་དང་། བདག་གིས་ནི་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་དག་གི་རྗེས་སུ་བསླབ་དགོས་སོ་སྙམ་པ་དང་། བདག་དགོན་པ་ན་གནས་ཏེ། ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་དག་ཏུ་སོང་སྟེ། སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་བྱའོ་སྙམ་པ་སྟེ། ཀླུའི་བདག་པོ་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ནགས་དང་ནགས་འདབ་ན་རྒྱུ་ཞིང་བས་མཐའི་གནས་མལ་དག་ན་གནས་པ་ཡིན་ནོ།
en: I have previously been part of society, but now I will no longer live in just one place.’ The second is the thought, ‘I am gathering the ornaments of the seat of awakening, rather than the afflictions.’ The third is the thought, ‘I must study with myriad well-trained bodhisattvas.’ The fourth is the thought, ‘Once I have accomplished all manner of positive qualities through living in the forest, I will travel to villages, towns, cities, lands, countries, and capitals preaching the Dharma to beings.’ Nāga Lord, if they have these four, they will travel through jungles and forests and stay in dwellings in the hinterlands.

source: །ཀླུའི་བདག་པོ་གསུམ་པོ་འདི་དག་ནི་འཕགས་པའི་རིགས་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དང་ཕན་ཡོན་ཕུལ་དང་རབ་མཆོག་ཡིན་ཏེ།
en: “Nāga Lord, three things are the best and greatest qualities and comforts of bodhisattvas who are of noble lineage, who observe ascetic practices, and who have few possessions.

source: དགའ་བ་དང་། མི་དགའ་བ་རྣམས་ལ་མི་ལྟ་བའི་ཕྱིར་འདུ་འཛིའི་བྱ་བ་མེད་པ་དང་། སེམས་རག་ལས་པ་མེད་ཅིང་གང་དུ་འདོད་པར་འགྲོར་ཡོད་པའི་ཕྱིར་རང་ཉམ་དང་། རང་དབང་དང་། ཐ་མལ་པར་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་སེམས་པའི་ཕྱིར་དེའི་ཏིང་ངེ་འཛིན་མྱུར་དུ་སྐྱེ་བར་འགྱུར་བ་སྟེ།
en: They are having no social activities due to being unconcerned with friends and enemies; living a humble, independent, and simple life due to having a free spirit and going wherever they please; and swiftly developing absorption due to considering all beings to be the same.

source: གསུམ་པོ་དེ་དག་གོ།
en: These are the three.

source: །གཞན་ཡང་གསུམ་སྟེ།
en: “There is an alternate set of three:

source: དེ་ལ་ཚུལ་འཆོས་པ་དང་། ཁ་གསག་མི་འབྱུང་བ་དང་། དེ་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བའི་སེམས་མི་སྐྱེ་བ་དང་། སྒྲུབ་ཅིང་འདུག་པ་ན་ཁྱིམ་ལ་རྗེས་སུ་ལྟ་བར་མི་འགྱུར་བ་སྟེ།
en: not being hypocritical or pretentious toward others, not getting attached to or angry toward others, and having no concern for household when staying somewhere to practice.

source: ཀླུའི་བདག་པོ་གསུམ་པོ་དེ་དག་ནི་འཕགས་པའི་རིགས་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དང་། ཕན་ཡོན་ཕུལ་དང་རབ་མཆོག་ཡིན་ནོ།
en: Nāga Lord, these three things are the best and greatest qualities and comforts of bodhisattvas who are of noble lineage, who observe ascetic practices, and who have few possessions.

source: །ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་འབྱུང་བའི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas have eight qualities, they will perfect their qualities of renunciation.

source: བརྒྱད་གང་ཞེ་ན།
en: What are these eight? They are being satisfied with the noble lineage; observing ascetic practices;

source: འཕགས་པའི་རིགས་ཀྱིས་ཆོག་པར་འཛིན་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་པ་དང་། མང་དུ་ཐོས་པ་དང་། སེམས་ངེས་པར་སེམས་པ་ལ་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ལ་ཀུན་ཏུ་རྨོངས་པ་མང་བུ་དང་། དྲན་པ་ཉེ་བར་གཞག་པས་གནས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་སྒོམ་པའི་སྦྱོར་བ་ལ་བརྩོན་པ་དང་། བརྩམས་པ་ཐམས་ཅད་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་སྟེ།
en: having few possessions; learnedness; having a preference for deep contemplation of one’s own thoughts; having no delusion about the bodhisattva attitude; being diligent in the practice of cultivating the applications of mindfulness, absorption, and insight; and ensuring all one’s endeavors come down to the essential practice.

source: ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་འབྱུང་བའི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas have these eight qualities, they will perfect their qualities of renunciation.

source: །ཀླུའི་བདག་པོ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཟབ་མོའི་ཚུལ་ལ་གནས་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have ten qualities, they will adhere to the profound Dharma.

source: བཅུ་གང་ཞེ་ན།
en: What are these ten? Through the intrinsic nature of the self, they are aligned with the intrinsic nature of phenomena; through the purity of the self, they are connected with the purity of all phenomena; through the absence of self, they are dedicated to the absence of self in phenomena; through the emptiness of self, they are certain about the emptiness of all phenomena; through the voidness of self, they enter the voidness of all phenomena;

source: བདག་གི་ངོ་བོ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། བདག་དག་པས་ཆོས་ཐམས་ཅད་དག་པའི་རྗེས་སུ་འཇུག་པ་དང་། བདག་བདག་མེད་པས་ཆོས་ཐམས་ཅད་བདག་མེད་པ་ལ་མོས་པ་དང་། བདག་སྟོང་པས་ཆོས་ཐམས་ཅད་སྟོང་པར་སོམ་ཉི་མེད་པ་དང་། བདག་དབེན་པས་ཆོས་ཐམས་ཅད་དབེན་པ་ལ་འཇུག་པ་དང་། བདག་ཞི་བས་ཆོས་ཐམས་ཅད་ཞི་བར་སོ་སོར་རྟོག་པ་དང་། བདག་ཇི་ལྟ་བ་བཞིན་པས་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པ་དང་། བདག་ཟབ་པས་ཆོས་ཐམས་ཅད་ཟབ་པར་ངེས་པར་སེམས་པ་དང་། བདག་བེམས་པོ་ཡིན་པས་ཆོས་ཐམས་ཅད་བེམས་པོ་ཡིན་པར་ངེས་པར་རྟོག་པ་དང་། བདག་གཟུང་དུ་མེད་པས་ཆོས་ཐམས་ཅད་གཟུང་དུ་མེད་པར་རབ་ཏུ་ཤེས་པ་སྟེ།
en: through the quelling of self, they discern the quelling of all phenomena; through the actual nature of the self, they fathom the actual nature of all phenomena; through the profundity of self, they reflect on the profundity of all phenomena; through the materiality of the self, they consider the materiality of all phenomena; and through the ungraspability of the self, they understand the ungraspability of all phenomena.

source: བཅུ་པོ་དེ་དག་གོ།
en: These are the ten.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཟབ་མོའི་ཚུལ་ལ་གནས་པ་ཡིན་ཏེ།
en: “Nāga Lord, there is an alternate set of ten qualities through which bodhisattvas will adhere to the profound Dharma.

source: རྣམ་པར་བསྒྲུབས་པས་གནས་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བར་མཐོང་བས་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། ཕྱིན་ཅི་ལོག་ཏུ་འདུ་ཤེས་པས་ཆོས་ཐམས་ཅད་སྨིག་རྒྱུ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། རྒྱུའི་བྱ་བ་དང་། རྐྱེན་ལ་དམིགས་ཏེ་སྐྱེ་བའི་ཆོས་ཐམས་ཅད་མིག་ཡོར་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། འཕོ་བ་མེད་པའི་མཚན་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པས་ཆོས་ཐམས་ཅད་ཆུ་ཟླ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། ཡུལ་ལ་མི་གནས་ཤིང་ཕྱོགས་ན་མི་གནས་ཏེ་ངོ་བོ་ཉིད་མེད་པས་ཆོས་ཐམས་ཅད་བྲག་ཅ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། སྐད་ཅིག་ཀྱང་མི་སྡོད་པས་ཆོས་ཐམས་ཅད་སྤྲིན་དང་གློག་སྣང་བ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་ཆགས་པར་མི་འགྱུར་བས་ཆོས་ཐམས་ཅད་འཇའ་ཚོན་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་དང་། གློ་བུར་གྱི་ཉེ་བའི་ཉོན་མོངས་པས་ཉོན་མོངས་པ་ཅན་དུ་མི་འགྱུར་བས་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རབ་ཏུ་དག་པར་ཤེས་པ་དང་། སྐྱེ་བ་དང་། འཇིག་པ་དང་། གནས་པ་དང་བྲལ་བས་ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུར་རབ་ཏུ་ཤེས་པ་སྟེ།
en: They know all phenomena to be like visual distortions given that they are based in causes and conditions. They know all phenomena to be like the moon in water because they never transfer from one state to another. They know all phenomena to be like echoes given that they cannot be found in any location or direction and thus do not have an essential nature. They know all phenomena to be like clouds and flashes of lightning given that they do not last for even a moment. They know that all phenomena are like rainbows given that they are not affected by attachment, aggression, and stupidity. They know all phenomena to be naturally pure given that they are not affected by adventitious subsidiary afflictions. They know all phenomena to be like space given that they are beyond birth, destruction, or persisting.

source: ཀླུའི་བདག་པོ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཟབ་མོའི་ཚུལ་ལ་གནས་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these ten qualities, they will adhere to the profound Dharma.

source: །ཀླུའི་བདག་པོ་ཆོས་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆད་པར་ལྟ་བར་ལྟུང་བར་མི་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas have two qualities, they will not fall into the view of nihilism.

source: གཉིས་གང་ཞེ་ན།
en: What are these two?

source: ལས་ཀྱི་བྱ་བ་ལ་འཇུག་པ་ཤེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རྣམ་པར་སྒྲུབ་པ་ཤེས་པ་སྟེ།
en: They are knowledge of karma and knowledge of the way to accomplish all the qualities of buddhahood.

source: ཀླུའི་བདག་པོ་ཆོས་དེ་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆད་པར་ལྟ་བར་ལྟུང་བར་མི་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas have these two qualities, they will not fall into the view of nihilism.

source: །ཀླུའི་བདག་པོ་ཆོས་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྟག་པར་ལྟ་བར་ལྟུང་བར་མི་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas have two qualities, they will not fall into the view of eternalism.

source: མི་རྟག་པའི་ཆོས་ལ་འཇུག་པ་ཤེས་པ་དང་། སྐྱེས་ནས་ཞིག་ཅིང་ཞུ་སྟེ། མི་གནས་པར་རབ་ཏུ་རྣམ་པར་དབྱེ་བ་ཤེས་པ་སྟེ།
en: They are knowledge of impermanent phenomena and knowledge that discerns that once phenomena have arisen, they will dissolve and dissipate, and thus not persist.

source: ཀླུའི་བདག་པོ་ཆོས་དེ་གཉིས་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྟག་པར་ལྟ་བར་ལྟུང་བར་མི་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas have these two qualities, they will not fall into the view of eternalism.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བརྟེན་ཏེ།
en: “Nāga Lord, if bodhisattvas have four qualities, they will be learned in dependent origination.

source: འབྱུང་བ་ལ་མཁས་པ་ཡིན་ཏེ།
en: They understand the process that leads from the origination of ignorance to the origination of aging and death.

source: མ་རིག་པ་ཀུན་འབྱུང་བ་ནས་རྒ་ཤི་ཀུན་འབྱུང་བའི་བར་ལ་འཇུག་པ་དང་། མ་རིག་པ་འགག་པ་ནས་རྒ་ཤི་འགག་པའི་བར་ལ་འཇུག་པ་དང་། ཆད་པར་ལྟ་བར་ཡང་མི་ལྟུང་བ་དང་། རྟག་པར་ལྟ་བར་ཡང་མི་གནས་པ་སྟེ།
en: They understand the process that leads from the cessation of ignorance to the cessation of aging and death. They do not fall into the view of nihilism. And they do not subscribe to the view of eternalism.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་པ་ལ་མཁས་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these four qualities, they will be skilled in understanding dependent origination.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དུ་ལྟ་བར་མི་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas have four qualities, they will not harbor any metaphysical views.

source: སྟོང་པ་ཉིད་ཤེས་པས་བདག་དང་སེམས་ཅན་དུ་ལྟ་བར་མི་འགྱུར་བ་དང་། མཚན་མ་མེད་པ་ཤེས་པས་སྲོག་དང་གང་ཟག་ཏུ་ལྟ་བར་མི་འགྱུར་བ་དང་། སྨོན་པ་མེད་པ་ཤེས་པས་འབྱུང་བ་དང་འཇིག་པར་ལྟ་བར་མི་འགྱུར་བ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤེས་པས་ཆད་པ་དང་རྟག་པར་ལྟ་བར་མི་འགྱུར་བ་སྟེ།
en: Knowing emptiness, they will not harbor views about self or beings. Knowing the absence of marks, they will not harbor views about a life force and a person. Knowing the absence of wishes, they will not harbor views about emergence and destruction. Knowing dependent origination, they will not harbor views of nihilism or eternalism.

source: ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དུ་ལྟ་བར་མི་འགྱུར་རོ།
en: Nāga Lord, if bodhisattvas have these four qualities, they will not harbor metaphysical views.

source: །ཀླུའི་བདག་པོ་ཆོས་དྲུག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མངོན་པར་ཤེས་པའི་ཤེས་པས་རྣམ་པར་རྩེ་བར་འགྱུར་ཏེ།
en: “Nāga Lord, if bodhisattvas have six qualities, they will display higher knowledge.

source: དྲུག་གང་ཞེ་ན།
en: What are these six?

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་ལྟ་བས་དེའི་ལྷའི་མིག་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ངན་དུ་སྨྲས་པའི་ཚིག་དང་དུ་ལེན་པས་ལྷའི་རྣ་བ་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། སེམས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པས་གཞན་གྱི་སེམས་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། སྔོན་བྱས་པའི་དགེ་བའི་རྩ་བ་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་བས་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། འཐུན་པར་བྱེད་པ་དང་། བཀའ་བློ་བདེ་བ་དང་། ཇི་སྐད་སྨྲས་པ་བཞིན་བྱེད་པས་རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ཆོས་རྣམས་ལ་སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་མེད་པས་ཟག་པ་ཟད་པ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་བ་སྟེ།
en: Regarding all beings without anger brings about the purity of divine vision; patiently accepting malicious words brings about the purity of divine hearing; eliminating the mind’s pollutions brings about the purity of knowing the minds of others; giving the roots of virtue one has created in the past to all beings brings about the purity of recollecting previous lives; being agreeable, offering advice, and practicing what one preaches brings about the purity of knowing how to perform miracles; and not being stingy with sharing the teachings brings about the purity of knowing the exhaustion of the defilements.

source: དྲུག་པོ་དེ་དག་གོ།
en: These are the six.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་མར་མེ་བྱིན་པས་ནི་ལྷའི་མིག་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: “Alternatively, Nāga Lord, offering lamps brings about the purity of divine vision;

source: །སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུའི་དབྱངས་ཐམས་ཅད་བྱིན་པས་ནི་ལྷའི་རྣ་བ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: playing cymbals and drums and singing songs brings about the purity of divine hearing;

source: །ཀུན་ནས་ཉོན་མོངས་པ་མེད་པར་བྱིན་པས་ནི་གཞན་གྱི་སེམས་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: generosity devoid of pollution brings about the purity of clairvoyance;

source: དགེ་བའི་ཆོས་དྲན་པར་བྱེད་ཅིང་བསྐུལ་བས་ནི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: helping others recollect and aspire toward virtuous qualities brings about the purity of the recollection of past lives;

source: །སྒྲིབ་པ་དང་། འགྱོད་པ་བསལ་བས་ནི་རྫུ་འཕྲུལ་གྱི་བྱ་བ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: eliminating obscuration and regret brings about the purity of knowing how to perform miracles;

source: །ཆོས་བྱིན་པས་ནི་ཟག་པ་ཟད་པ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: and giving the Dharma brings about the purity of knowing the exhaustion of the defilements.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་ལྟ་བས་ནི་ལྷའི་མིག་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: “Alternatively, Nāga Lord, gazing at the Thus-Gone One brings about the purity of divine vision;

source: །དམ་པའི་ཆོས་མཉན་པས་ནི་ལྷའི་རྣ་བ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: listening to the sublime Dharma brings about the purity of divine hearing;

source: །སེམས་ཀྱིས་ངེས་པར་བརྟགས་པས་ནི་གཞན་གྱི་སེམས་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: engaging the mind in accurate analysis brings about the purity of clairvoyance;

source: །དགེ་འདུན་རྗེས་སུ་དྲན་པས་ནི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: recollecting the Saṅgha brings about the purity of the recollection of past lives;

source: །འདུན་པ་དྲག་པོས་ནི་རྫུ་འཕྲུལ་གྱི་བྱ་བ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: intense fervor brings about the purity of knowing how to perform miracles;

source: །ཆོས་སྒྲུབ་པས་ནི་ཟག་པ་ཟད་པ་ཤེས་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: accomplishing the Dharma brings about the purity of knowing the exhaustion of the defilements.

source: །དེ་ལ་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ་གང་ཞེ་ན།
en: “In this context, how do they engage in play by means of these higher knowledges?

source: ཀླུའི་བདག་པོ་འདི་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དང་། ཕྱི་རོལ་གྱི་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དེ་བས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་མིག་དེ་ཆེས་འདས་པ་དང་། ཆེས་གསལ་བ་དང་། ཆེས་ཁྱད་པར་དུ་འཕགས་པ་དང་། ཆེས་མཆོག་ཏུ་གྱུར་པ་དང་། ཆེས་རྣམ་པར་དག་པ་སྟེ།
en: Nāga Lord, in this regard, the divine vision of bodhisattvas surpasses and is more clear, elevated, great, and pure than the divine vision of the hearers and solitary buddhas, the divine vision of the five higher knowledges of non-Buddhist sages, and the divine vision of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and human and nonhuman beings.

source: དེའི་ལྷའི་མིག་དེས་ནི་དེ་བཞིན་གཤེགས་པའི་སྤྱན་གྱི་ཡུལ་མ་གཏོགས་པར་སེམས་ཅན་དུ་སྣང་བའམ། གཟུགས་སུ་སྣང་བའམ། ཆོས་སུ་སྣང་བ་གང་ཡང་མི་རྟོགས་པ་དང་། མི་མཐོང་བ་དང་། མི་ཤེས་པ་ཅི་ཡང་མེད་དོ།
en: Other than the object of the Thus-Gone One’s vision, there is no appearance of being, form, or phenomena that is not realized, seen, or known by this divine eye of theirs.

source: །ཀླུའི་བདག་པོ་དེ་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྷའི་རྣ་བ་གང་ཡིན་པ་ནས་མི་དང་མི་མ་ཡིན་པའི་བར་རྣམས་ཀྱི་ལྷའི་རྣ་བ་གང་ཡིན་པ་དེ་བས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་རྣ་བ་དེ་ཆེས་འདས་པ་དང་། ཆེས་གསལ་བ་དང་། ཆེས་ཁྱད་པར་དུ་འཕགས་པ་དང་། ཆེས་མཆོག་ཏུ་གྱུར་པ་དང་། ཆེས་རྣམ་པར་དག་པ་སྟེ།
en: “Nāga Lord, the divine hearing of bodhisattvas surpasses and is clearer, more elevated, greater, and purer than the divine ear of the same list of beings from hearers and solitary buddhas to human and nonhuman beings.

source: དེ་ལྷའི་རྣ་བའི་དབང་པོ་དེས་ནི་དེ་བཞིན་གཤེགས་པའི་སྙན་གྱི་ཡུལ་མ་གཏོགས་པ་སྒྲར་གྲག་པ་གང་ཡང་ཐོས་པར་མི་འགྱུར་བ་ཅི་ཡང་མེད་དེ།
en: Other than the Thus-Gone One’s field of hearing, there is no sound whatsoever that is not heard by this divine ear.

source: དེས་ནི་སྒྲ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་གཅོད་པ་རབ་ཏུ་ཤེས་སོ།
en: It is able to determine all the sounds of the past and future.

source: །ཀླུའི་བདག་པོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུ་བ་དང་། སེམས་ཀྱི་དམིགས་པ་དང་། སེམས་ཀྱི་མཚན་མ་དང་། སེམས་ཀྱི་དཔྱོད་པ་དང་། སེམས་ཀྱི་རྒྱུ་དང་། སེམས་ཀྱི་བསམ་པ་དང་། སེམས་ཀྱི་འབྲས་བུ་དང་། སེམས་ཀྱི་ངེས་པ་དང་། སེམས་ཀྱི་བརྟག་པ་དང་། སེམས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་དང་། སེམས་ཀྱི་རྗེས་སུ་ཆགས་པ་དང་། སེམས་ཀྱི་ཁོང་ཁྲོ་བ་དང་། སེམས་རྣམ་པར་གཡེངས་པ་དང་། སེམས་བསྡུ་བ་དང་། སེམས་བྲལ་བར་གཡོ་བ་དང་། སེམས་ལྷག་པར་གཡོ་བ་དང་། སེམས་བསྐུལ་བ་དང་། སེམས་གནས་པ་དང་། སེམས་ཀྱི་སྔོན་གྱི་མཐའ་དང་། སེམས་ཀྱི་ཕྱི་མའི་མཐའ་དང་། སེམས་ཀྱི་ད་ལྟར་བྱུང་བ་དང་། སེམས་ཀྱི་གནས་དང་། སེམས་ཀྱི་གནས་པ་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “In this way, Nāga Lord, bodhisattvas truly and accurately know all the mental movements, mental apprehending, mental marks, mental inquiries, mental causes, mental perspectives, mental results, mental certainties, mental analyses, mental images, mental attachments, mental aggressions, mental distractions, mental grasping, mental quietudes, mental excitements, mental invigorations, and mental states of all beings, as well as their past, future, and present states of mind and how their minds persist.

source: ཤེས་ནས་ཀྱང་དེ་བཞིན་དུ་དེས་སེམས་ཅན་དེ་དག་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་འཇུག་པར་བྱེད་དོ།
en: In short, they know their every state of mind and are thus able to engage in Dharma discussions with them.

source: །དེས་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པས་བདག་དང་གཞན་རྣམས་ཀྱི་སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་བར་གྱི་འཆི་འཕོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཤིང་དྲན་ཏེ། རྣམ་པ་དང་བཅས། ཡུལ་ཕྱོགས་དང་བཅས་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་ཁོ་ན་ཉིད་དང་གཞན་མ་ཡིན་པར་རྗོད་པར་བྱེད་དོ།
en: With their recollection of past lives, they are capable of truly and accurately knowing and remembering the deaths and transmigrations of themselves and others, extending into the most distant reaches of the past, and of accurately describing the precise forms and venues for these lives.

source: །རྫུ་འཕྲུལ་གྱི་བྱ་བ་རྣམས་ལ་ཡང་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ཐོབ་སྟེ་བྱ་བ་ཐམས་ཅད་སྟོན་ཏོ།
en: They display all kinds of actions without being subject to the accumulation of karma, even with respect to miraculous actions.

source: །ཀླུའི་བདག་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་སྟེ།
en: Nāga Lord, such are bodhisattvas’ higher knowledges.

source: དེ་ལ་རང་གི་སེམས་ལ་དབང་བྱེད་པས་དོན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་འདི་ནི་དེའི་རྣམ་པར་རྩེ་བ་སྟེ།
en: The fulfillment of all aims through exercising mastery over their own minds is their play.

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཡང་ཀུན་ཏུ་སྟོན་ལ་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་མི་བྱེད་པ་ལྟ་བུའོ།
en: This is how buddhas make a display of passing entirely beyond suffering, without passing entirely beyond suffering in such a way that they pass entirely beyond suffering permanently.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཟག་པ་ཟད་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱེད་པའི་མངོན་པར་ཤེས་པ་གང་ཞེ་ན།
en: “What then is the higher knowledge that engenders a bodhisattva’s ability to manifest the knowledge of the exhaustion of the defilements?

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བ་ལ་མ་ཆགས་ཏེ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྣམ་པར་གྲོལ་བ་ལ་ལྷག་པར་དམིགས་ཤིང་རང་བཞིན་གྱིས་ཟག་པ་ཟད་པ་ཤེས་ཀྱི་ཤེས་པ་དེ་མངོན་སུམ་དུ་བྱེད་པ་ནི་མ་ཡིན་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཟག་པ་ཟད་པར་བྱ་བ་ཁོ་ནའི་ཕྱིར་ཡང་འཁོར་བའི་རྒྱུན་ལ་གནས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་དྲུག་པའོ།
en: Without being attached to the liberation of the hearers and solitary buddhas, they specifically focus on the liberation of the wisdom of awakened wisdom and thereby know the natural exhaustion of the defilements. However, they do not actualize that knowledge; instead, they remain in the stream of saṃsāra only to bring about the exhaustion of the defilements for all beings. This is the bodhisattvas’ sixth higher knowledge.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ལ་འཇུག་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have four qualities, they will see wisdom without obscuration.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྒོས་པའི་མངོན་པར་ཤེས་པ་ལྔ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བསྒོས་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། ཐབས་དང་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བསྒོས་པའི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པས་ཡོངས་སུ་བསྒོས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཏེ།
en: They should possess the five forms of higher knowledge that are suffused by omniscient wisdom, the four correct discriminations that are suffused by great love and great compassion, the four formless attainments that are suffused by means and insight, and the thirty-seven factors of awakening that are suffused by emptiness, the absence of marks, and the absence of wishes.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ལ་འཇུག་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these four qualities, they will see with unobscured wisdom.

source: །ཀླུའི་བདག་པོ་དེ་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་གང་ཞེ་ན།
en: “Nāga Lord, what, in this context, does it mean to see with unobscured wisdom?

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་མཐོང་ལ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་རྣམ་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་བཅོམ་པ་གང་ཡིན་པ་དང་། འཁོར་བ་ཡང་མཐོང་ལ་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་ཡང་དག་པར་གཞོལ་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ཡང་མཐོང་ལ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཡང་ཡང་དག་པར་གཞོལ་བ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པའི་རྗེས་སུ་ཡང་འཇུག་ལ་སེམས་ཅན་གྱི་སྤྱོད་པ་དབེན་པར་ཡང་ཤེས་པ་སྟེ།
en: It means acknowledging all the afflictions while truly defeating all the afflictions and their attendant habitual tendencies, acknowledging saṃsāra while attaining nirvāṇa, acknowledging the states of hearers and solitary buddhas while attaining the seat of awakening, and emulating the behavior of beings while knowing it to be void.

source: འདི་ནི་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ཞེས་བྱའོ།
en: This is what it means to see with unobscured wisdom.

source: །གཞན་ཡང་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ནི་འདུས་བྱས་ཀྱི་བྱ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཡང་འཇུག་ལ། འདུས་མ་བྱས་པ་ཡང་ཐོབ་པ་གང་ཡིན་པ་དང་། འདུས་བྱས་ཐམས་ཅད་ཀྱི་ཉེ་བར་ཞི་བ་ཡང་མཐོང་ལ་འདུས་མ་བྱས་ཀྱང་ཐོབ་པའོ།
en: “Alternatively, seeing with unobscured wisdom can mean conforming to all kinds of conditioned actions while attaining the unconditioned, seeing the pacification of conditioned phenomena while attaining the unconditioned.

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདུས་བྱས་ལ་སྤྱོད་པ་ན་ཡང་འདུས་མ་བྱས་ཤེས་པས་སྒྲིབ་པ་མེད་པ་ལ།
en: Nāga Lord, even when bodhisattvas operate within the conditioned, they are not obstructed by their knowledge of the unconditioned.
